In [1]:
# Importar librería para la conexión con MySQL
# -----------------------------------------------------------------------
import mysql.connector
from mysql.connector import errorcode


# Importar librerías para manipulación y análisis de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("../Manual/Files/eda_final.csv", index_col=0)
df

,name_w,year_w,price,user_score,type_w,region,alcohol_content,wine_grape,pk_score,pn_score,sk_score
0,Ultreia Saint Jacques,2021,11.50,4.2,Vino tinto,Bierzo,13.5,Mencía,93.0,92.0,NaN
1,José Pariente Verdejo,2022,10.50,4.5,Vino blanco,Rueda,13.0,Verdejo,NaN,92.0,NaN
2,Tinto Pesquera Crianza,2020,19.30,4.6,Vino tinto,Ribera del Duero,14.5,Tempranillo,NaN,92.0,93.0
3,La Montesa,2020,15.35,4.3,Vino tinto,Rioja,14.0,Garnacha,93.0,93.0,94.0
4,Terras Gauda,2022,15.75,4.6,Vino blanco,Rías Baixas,12.0,Albariño,NaN,92.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...
819,Capricho Val de Paxariñas,2022,11.95,4.8,Vino blanco,Bierzo,13.5,Godello,90.0,93.0,NaN
820,Campo Viejo Crianza,2020,5.75,4.5,Vino tinto,Rioja,13.5,Tempranillo,NaN,NaN,NaN
821,Poesia Garnacha Tinta,2021,3.90,4.1,Vino tinto,Catalunya,13.5,Garnacha,NaN,NaN,NaN
822,Monasterio de las Viñas Crianza,2019,5.20,5.0,Vino tinto,Cariñena,13.5,Tempranillo,NaN,NaN,NaN
823,Faustino V Rosado,2022,5.45,4.1,Vino rosado,Rioja,13.5,Tempranillo,NaN,NaN,NaN

### Tabla 1

In [22]:
#DATA FRAME DE LA TABLA 1 - FICHA PERSONAL 
df_tabla1 = df[["name_w","year_w", "region"]]
df_tabla1.head(3)

                   name_w year_w            region
0   Ultreia Saint Jacques   2021            Bierzo
1   José Pariente Verdejo   2022             Rueda
2  Tinto Pesquera Crianza   2020  Ribera del Duero

In [23]:
df_tabla1.dtypes

name_w    object
year_w    object
region    object
dtype: object

In [24]:
df_tabla1 = df_tabla1.fillna(0)

In [6]:
lista_tuplas_tabla = []
for x in df_tabla1.values:

    lista_tuplas_tabla.append(tuple(x))
    lista_tuplas_tabla

In [26]:
cnx = mysql.connector.connect (user = "root", 
                               password = "AlumnaAdalab", 
                               host='127.0.0.1',
                               database="the_wine_lab")

mycursor = cnx.cursor()

query_insert = "INSERT INTO 1_wine_info (name_w, year_w, region) VALUES (%s, %s, %s)"
#variables en el mismo orden que scsv, tantas %s como variables tiene mi csv. 


try: 
    mycursor.executemany(query_insert, lista_tuplas_tabla)
    #ejecuta my query, de que datos? del fichero q estan en mi lista de tuplas q he converido ariba leyendo el csv.) 
    cnx.commit()
    print(mycursor.rowcount, "registros insertados")

except mysql.connector.Error as error:
    print("Error al insertar datos en MySQL:", error)

Error al insertar datos en MySQL: Not all parameters were used in the SQL statement

### TABLA 3

In [27]:
df_tabla3 = df[["price", "alcohol_content", "wine_grape", "type_w", "name_w"]]
df_tabla3.head(3)

   price  alcohol_content   wine_grape       type_w                  name_w
0   11.5             13.5       Mencía   Vino tinto   Ultreia Saint Jacques
1   10.5             13.0      Verdejo  Vino blanco   José Pariente Verdejo
2   19.3             14.5  Tempranillo   Vino tinto  Tinto Pesquera Crianza

In [28]:
df_tabla3 = df_tabla3.fillna(0)

In [10]:
df_tabla3.dtypes

price              float64
alcohol_content    float64
wine_grape          object
type_w              object
name_w              object
dtype: object

In [29]:
lista_tuplas_tabla = []
for x in df_tabla3.values:

    lista_tuplas_tabla.append(tuple(x))
    lista_tuplas_tabla

In [30]:
cnx = mysql.connector.connect (user = "root", 
                               password = "AlumnaAdalab", 
                               host='127.0.0.1',
                               database="the_wine_lab")

mycursor = cnx.cursor()

query_insert = "INSERT INTO 3_wine_type_price (price, alcohol_content, wine_grape, type_w, 1_wine_info_name_w) VALUES (%s, %s, %s, %s, %s)"
#variables en el mismo orden que scsv, tantas %s como variables tiene mi csv. 


try: 
    mycursor.executemany(query_insert, lista_tuplas_tabla)
    #ejecuta my query, de que datos? del fichero q estan en mi lista de tuplas q he converido ariba leyendo el csv.) 
    cnx.commit()
    print(mycursor.rowcount, "registros insertados")

except mysql.connector.Error as error:
    print("Error al insertar datos en MySQL:", error)

799 registros insertados

### TABLA 2

In [3]:
#DATA FRAME DE LA TABLA 2 - FICHA PERSONAL 
df_tabla2 = df[["user_score","pk_score", "pn_score", "sk_score", "name_w"]]
df_tabla2.head(3)

   user_score  pk_score  pn_score  sk_score                  name_w
0         4.2      93.0      92.0       NaN   Ultreia Saint Jacques
1         4.5       NaN      92.0       NaN   José Pariente Verdejo
2         4.6       NaN      92.0      93.0  Tinto Pesquera Crianza

In [4]:
df_tabla2 = df_tabla2.fillna(0)

In [5]:
lista_tuplas_tabla = []
for x in df_tabla2.values:

    lista_tuplas_tabla.append(tuple(x))
    lista_tuplas_tabla

In [34]:
df_tabla2.dtypes

user_score    float64
pk_score      float64
pn_score      float64
sk_score      float64
name_w         object
dtype: object

In [6]:
cnx = mysql.connector.connect (user = "root", 
                               password = "AlumnaAdalab", 
                               host='127.0.0.1',
                               database="the_wine_lab")

mycursor = cnx.cursor()

query_insert = "INSERT INTO 2_scoring (user_score, pk_score, pn_score, sk_score, 1_wine_info_name_w) VALUES ( %s, %s, %s, %s, %s)"
#variables en el mismo orden que scsv, tantas %s como variables tiene mi csv. 


try: 
    mycursor.executemany(query_insert, lista_tuplas_tabla)
    #ejecuta my query, de que datos? del fichero q estan en mi lista de tuplas q he converido ariba leyendo el csv.) 
    cnx.commit()
    print(mycursor.rowcount, "registros insertados")

except mysql.connector.Error as error:
    print("Error al insertar datos en MySQL:", error)

799 registros insertados

In [19]:
df.dtypes

name_w              object
year_w              object
price              float64
user_score         float64
type_w              object
region              object
alcohol_content    float64
wine_grape          object
pk_score           float64
pn_score           float64
sk_score           float64
dtype: object

In [7]:
df.to_csv('../Manual/Files/sql_upload.csv')